#include "EnemyMoveState.h"
#include "application/object/entity/enemy/BaseEnemy.h"

///-------------------------------------------/// 
/// 初期化処理
///-------------------------------------------///
void EnemyMoveState::Enter(BaseEnemy* enemy) {
	enemy_ = enemy;
}

///-------------------------------------------/// 
/// 更新処理
///-------------------------------------------///
void EnemyMoveState::Update() {
	/// ===タイマーの更新=== ///

	/// ===移動処理=== ///
	Move();

	/// ===Stateの移動=== ///
	CheckTransition();
}

///-------------------------------------------/// 
/// 終了処理
///-------------------------------------------///
void EnemyMoveState::Exit() {
	EnemyState::Exit();
}

///-------------------------------------------/// 
/// 移動処理
///-------------------------------------------///
void EnemyMoveState::Move() {
	// 移動先の座標の二マス下に地面があるかどうかを確認。有ればそのまま進む、なければY軸を180度回転して進む。
}
 
///-------------------------------------------/// 
/// 状態遷移の確認
///-------------------------------------------///
void EnemyMoveState::CheckTransition() {
	// 視界の範囲内にPlayerがいるかどうかを確認。

}
