#include "EnemyAlertState.h"

///-------------------------------------------/// 
/// 初期化処理
///-------------------------------------------///
void EnemyAlertState::Enter(BaseEnemy* enemy) {
	enemy_ = enemy;
}

///-------------------------------------------/// 
/// 更新処理
///-------------------------------------------///
void EnemyAlertState::Update() {

}

///-------------------------------------------/// 
/// 終了処理
///-------------------------------------------///
void EnemyAlertState::Exit() {
	EnemyState::Exit();
}
